Revit 2024 API
BuiltInFailures.StructuralLoadFailures Class
 Failures about Load.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class StructuralLoadFailures
Visual Basic
Public NotInheritable Class StructuralLoadFailures
Visual C++
public ref class StructuralLoadFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures
See Also
BuiltInFailures.StructuralLoadFailures Members
Autodesk.Revit.DB Namespace